Revit 2024 API
PipeSettings.FlatOnTop Property
 The abbreviation of the Flat On Top (FOT) string.
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public string FlatOnTop { get; set; }
Visual Basic
Public Property FlatOnTop As String
	Get
	Set
Visual C++
public:
property String^ FlatOnTop {
	String^ get ();
	void set (String^ value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
PipeSettings Class
Autodesk.Revit.DB.Plumbing Namespace